In [1]:
# 판다스 그룹별 집계
import pandas as pd
import numpy as np

In [2]:
ipl_data = {'Team': ['Riders', 'Riders', 'Devils', 'Devils', 'Kings','kings', 'Kings', 'Kings', 'Riders', 'Royals', 'Royals', 'Riders'],
'Rank': [1, 2, 2, 3, 3,4 ,1 ,1,2 , 4,1,2],
'Year': [2014, 2015, 2014, 2015, 2014, 2015, 2016, 2017, 2016, 2014, 2015, 2017],
'Points':[876,789,863,673,741,812,756,788,694,701,804,690]}

In [3]:
df = pd.DataFrame(ipl_data)
df

      Team  Rank  Year  Points
0   Riders     1  2014     876
1   Riders     2  2015     789
2   Devils     2  2014     863
3   Devils     3  2015     673
4    Kings     3  2014     741
5    kings     4  2015     812
6    Kings     1  2016     756
7    Kings     1  2017     788
8   Riders     2  2016     694
9   Royals     4  2014     701
10  Royals     1  2015     804
11  Riders     2  2017     690

In [4]:
# df.groupby("1")["2"].sum()
#            1. 그룹의 기준이 되는 열
#            2. 적용받는 열
#            3. 적용받는 연산
df.groupby("Team")["Points"].sum()

Team
Devils    1536
Kings     2285
Riders    3049
Royals    1505
kings      812
Name: Points, dtype: int64

In [5]:
# 멀티 인덱스 그룹별 집계
# 한개 이상의 열을 기준으로 그룹별 집계를  실행
# 리스트를 사용해서 여러개의 열을 넣으면 키로 인식해서 계층적 형태로 출력

In [6]:
multi_groupby =  df.groupby(["Team","Year"])["Points"].sum()
multi_groupby

Team    Year
Devils  2014    863
        2015    673
Kings   2014    741
        2016    756
        2017    788
Riders  2014    876
        2015    789
        2016    694
        2017    690
Royals  2014    701
        2015    804
kings   2015    812
Name: Points, dtype: int64

In [7]:
multi_groupby.index

MultiIndex([('Devils', 2014),
            ('Devils', 2015),
            ( 'Kings', 2014),
            ( 'Kings', 2016),
            ( 'Kings', 2017),
            ('Riders', 2014),
            ('Riders', 2015),
            ('Riders', 2016),
            ('Riders', 2017),
            ('Royals', 2014),
            ('Royals', 2015),
            ( 'kings', 2015)],
           names=['Team', 'Year'])

In [8]:
type(multi_groupby)

pandas.core.series.Series

In [9]:
multi_groupby["Devils":"Kings"]

Team    Year
Devils  2014    863
        2015    673
Kings   2014    741
        2016    756
        2017    788
Name: Points, dtype: int64

In [10]:
multi_groupby.unstack()

Year     2014   2015   2016   2017
Team
Devils  863.0  673.0    NaN    NaN
Kings   741.0    NaN  756.0  788.0
Riders  876.0  789.0  694.0  690.0
Royals  701.0  804.0    NaN    NaN
kings     NaN  812.0    NaN    NaN

In [11]:
multi_groupby.swaplevel().sort_index()

Year  Team
2014  Devils    863
      Kings     741
      Riders    876
      Royals    701
2015  Devils    673
      Riders    789
      Royals    804
      kings     812
2016  Kings     756
      Riders    694
2017  Kings     788
      Riders    690
Name: Points, dtype: int64

In [12]:
multi_groupby.sum(level=1)

C:\Users\user\AppData\Local\Temp\ipykernel_11300\2969499072.py:1: FutureWarning: Using the level keyword in DataFrame and Series aggregations is deprecated and will be removed in a future version. Use groupby instead. df.sum(level=1) should use df.groupby(level=1).sum().
  multi_groupby.sum(level=1)

Year
2014    3181
2015    3078
2016    1450
2017    1478
Name: Points, dtype: int64

In [13]:
df.groupby("Year")["Points"].sum()

Year
2014    3181
2015    3078
2016    1450
2017    1478
Name: Points, dtype: int64

In [14]:
# 분할->적용->결합
#df.groupby("Year")["Points"].sum()
# 분할까지만 이루어지는 상태
grouped = df.groupby("Team")
grouped.get_group("Riders")

      Team  Rank  Year  Points
0   Riders     1  2014     876
1   Riders     2  2015     789
8   Riders     2  2016     694
11  Riders     2  2017     690

In [15]:
df.head()

     Team  Rank  Year  Points
0  Riders     1  2014     876
1  Riders     2  2015     789
2  Devils     2  2014     863
3  Devils     3  2015     673
4   Kings     3  2014     741

In [16]:
# 집계 aggregation  요약된 통계정보
# agg함수
grouped.agg(min)

        Rank  Year  Points
Team
Devils     2  2014     673
Kings      1  2014     741
Riders     1  2014     690
Royals     1  2014     701
kings      4  2015     812

In [17]:
grouped.agg(np.mean)

            Rank         Year      Points
Team
Devils  2.500000  2014.500000  768.000000
Kings   1.666667  2015.666667  761.666667
Riders  1.750000  2015.500000  762.250000
Royals  2.500000  2014.500000  752.500000
kings   4.000000  2015.000000  812.000000

In [18]:
# 변환
grouped

In [19]:
grouped.transform(max)

    Rank  Year  Points
0      2  2017     876
1      2  2017     876
2      3  2015     863
3      3  2015     863
4      3  2017     788
5      4  2015     812
6      3  2017     788
7      3  2017     788
8      2  2017     876
9      4  2015     804
10     4  2015     804
11     2  2017     876

In [20]:
z_score = lambda x: (x-x.mean()) / x.std()
grouped.transform(z_score)

        Rank      Year    Points
0  -1.500000 -1.161895  1.284327
1   0.500000 -0.387298  0.302029
2  -0.707107 -0.707107  0.707107
3   0.707107  0.707107 -0.707107
4   1.154701 -1.091089 -0.860862
5        NaN       NaN       NaN
6  -0.577350  0.218218 -0.236043
7  -0.577350  0.872872  1.096905
8   0.500000  0.387298 -0.770596
9   0.707107 -0.707107 -0.707107
10 -0.707107  0.707107  0.707107
11  0.500000  1.161895 -0.815759

In [21]:
# 필터 
df.groupby("Team").filter(lambda x:len(x) >=3)

      Team  Rank  Year  Points
0   Riders     1  2014     876
1   Riders     2  2015     789
4    Kings     3  2014     741
6    Kings     1  2016     756
7    Kings     1  2017     788
8   Riders     2  2016     694
11  Riders     2  2017     690

In [22]:
df.groupby("Team").filter(lambda x:len(x) <3)

      Team  Rank  Year  Points
2   Devils     2  2014     863
3   Devils     3  2015     673
5    kings     4  2015     812
9   Royals     4  2014     701
10  Royals     1  2015     804

In [23]:
df.groupby('Team').filter(lambda x: x['Points'].max() > 800)

      Team  Rank  Year  Points
0   Riders     1  2014     876
1   Riders     2  2015     789
2   Devils     2  2014     863
3   Devils     3  2015     673
5    kings     4  2015     812
8   Riders     2  2016     694
9   Royals     4  2014     701
10  Royals     1  2015     804
11  Riders     2  2017     690

In [24]:
# 병합 merge
# 내부 조인 inner join : 키 값을 기준으로 두 테이블에 모두 존재하는 키 값의 행끼리 병합
# 완전 조인 full join : 두개의 테이블에서 각각의 행을 병합
# 동일한 키 값을 가진 행은 통합하고, 두 테이블중 하나라도 키 값이 존재하지 않으면 존재하는 
# 쪽의 데이터만 남긴다.
# 왼쪽조인 left join : 왼쪽데이터를기준(왼쪽데이터는 다 나옮) 오른쪽은 왼쪽과 키가 같은 데이터만 표시
# 오른쪽 조인 right join : jeft join과 반대 개념

In [25]:
from random import sample
raw_data = {
    'subject_id':list(range(1,12)),
    'test_score':sample(range(100),11)
}
df_left = pd.DataFrame(raw_data)
df_left

    subject_id  test_score
0            1          30
1            2          50
2            3          18
3            4          21
4            5          20
5            6          81
6            7          43
7            8          99
8            9          75
9           10          11
10          11          46

In [26]:
raw_data = {
    'id':[4,5,6,7,8,15,20],
    'first_name':['billy', 'brain', 'leeky', 'abc','jamse','15','20'],
    'last_name':['abc','black','balm','brice','miky','15','20']
}
df_right = pd.DataFrame(raw_data)
df_right

   id first_name last_name
0   4      billy       abc
1   5      brain     black
2   6      leeky      balm
3   7        abc     brice
4   8      jamse      miky
5  15         15        15
6  20         20        20

In [27]:
df_left.columns = ['id','test_score']
df_left

    id  test_score
0    1          30
1    2          50
2    3          18
3    4          21
4    5          20
5    6          81
6    7          43
7    8          99
8    9          75
9   10          11
10  11          46

In [28]:
# 내부 조인(inner join)
pd.merge(left=df_left, right=df_right, how='inner',on='id')

   id  test_score first_name last_name
0   4          21      billy       abc
1   5          20      brain     black
2   6          81      leeky      balm
3   7          43        abc     brice
4   8          99      jamse      miky

In [29]:
pd.merge(left=df_left, right=df_right, how='inner',left_on='id', right_on='id')

   id  test_score first_name last_name
0   4          21      billy       abc
1   5          20      brain     black
2   6          81      leeky      balm
3   7          43        abc     brice
4   8          99      jamse      miky

In [30]:
# 왼쪽 조인 : 왼쪽테이블을기준으로 병합
# 왼쪽과 같지않는 오른쪽 테이블의 값은 NaN으로 출력
pd.merge(left=df_left, right=df_right,how='left', on='id')

    id  test_score first_name last_name
0    1          30        NaN       NaN
1    2          50        NaN       NaN
2    3          18        NaN       NaN
3    4          21      billy       abc
4    5          20      brain     black
5    6          81      leeky      balm
6    7          43        abc     brice
7    8          99      jamse      miky
8    9          75        NaN       NaN
9   10          11        NaN       NaN
10  11          46        NaN       NaN

In [31]:
pd.merge(left=df_left,right=df_right,how='right',on='id')

   id  test_score first_name last_name
0   4        21.0      billy       abc
1   5        20.0      brain     black
2   6        81.0      leeky      balm
3   7        43.0        abc     brice
4   8        99.0      jamse      miky
5  15         NaN         15        15
6  20         NaN         20        20